# -*- coding: utf-8 -*-

LEAD_TEST_CREATED       = 'Тестовый лид успешно добавлен'
LEAD_TEST_CRM_NOT_FOUND = 'Тестовый лид не обнаружен в crm'
LEAD_TEST_AUTH_FAIL     = 'Попытка получить данные тестового лида неуспешна из-за неверного или устаревшего токена'

LEAD_FAIL               = 'Попытка создать лид неуспешна'
LEAD_AUTH_FAIL          = 'Попытка создать лид неуспешна из-за неверного или устаревшего токена'

TASK_AUTH_FAIL          = 'Задача не добавлена из-за неверного или устаревшего токена'
TASK_FAIL               = 'Попытка обновить задачу неуспешна'
TASK_COMPLETE_FAIL      = 'Попытка завершить задачу неуспешна'

TOKEN_UPDATED           = 'Токен успешно обновлен'
TOKEN_UPDATE_FAIL       = 'Попытка обновить токен неуспешна'

SERVER_OVER_QUOTA       = 'Сервер перегружен'